"""
Задайте последовательность чисел.
Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.
"""

my_list = [1, 1, 23, 34, 5, 7, 8, 5, 2, 3, 8, 9, 21, 23]

my_set = set(my_list)

print(my_set)


